tiborsimon/embedded-tdd-headers/pic/pic18/pic18f65k80_tdd.h
#define B0D23                         1091
#define B0D24                         1092
#define B0D25                         1093
#define B0D26                         1094
#define B0D27                         1095
#define B0D3                          1096
#define B0D30                         1097
#define B0D31                         1098
#define B0D32                         1099
#define B0D33                         1100
#define B0D34                         1101
#define B0D35                         1102
#define B0D36                         1103
#define B0D37                         1104
#define B0D4                          1105
#define B0D40                         1106
#define B0D41                         1107
#define B0D42                         1108
#define B0D43                         1109
#define B0D44                         1110
#define B0D45                         1111
#define B0D46                         1112
#define B0D47                         1113
#define B0D50                         1114
#define B0D5                          1115
#define B0D51                         1116
#define B0D52                         1117
#define B0D53                         1118
#define B0D54                         1119
#define B0D55                         1120
#define B0D56                         1121
#define B0D57                         1122
#define B0D6                          1123
#define B0D60                         1124
#define B0D61                         1125
#define B0D62                         1126
#define B0D63                         1127
#define B0D64                         1128
#define B0D65                         1129
#define B0D66                         1130
#define B0D67                         1131
#define B0D7                          1132
#define B0D70                         1133
#define B0D71                         1134
#define B0D72                         1135
#define B0D73                         1136
#define B0D74                         1137
#define B0D75                         1138
#define B0D76                         1139
#define B0D77                         1140
#define CANSTAT_RO9                   1141
#define CANSTAT_RO9_EICODE0           1142
#define CANSTAT_RO9_EICODE1_ICODE0    1143
#define CANSTAT_RO9_ICODE0            1144
#define CANSTAT_RO9_EICODE1           1145
#define CANSTAT_RO9_EICODE2_ICODE1    1146
#define CANSTAT_RO9_ICODE1            1147
#define CANSTAT_RO9_EICODE2           1148
#define CANSTAT_RO9_ICODE2            1149
#define CANSTAT_RO9_EICODE3_ICODE2    1150
#define CANSTAT_RO9_EICODE3           1151
#define CANSTAT_RO9_EICODE4           1152
#define CANSTAT_RO9_OPMODE            1153
#define CANSTAT_RO9_OPMODE0           1154
#define CANSTAT_RO9_OPMODE1           1155
#define CANSTAT_RO9_OPMODE2           1156
#define CANCON_RO9                    1157
#define CANCON_RO9_FP0                1158
#define CANCON_RO9_WIN0               1159
#define CANCON_RO9_FP1                1160
#define CANCON_RO9_WIN0_FP1           1161
#define CANCON_RO9_WIN1               1162
#define CANCON_RO9_FP2                1163
#define CANCON_RO9_WIN1_FP2           1164
#define CANCON_RO9_WIN2_FP3           1165
#define CANCON_RO9_WIN2               1166
#define CANCON_RO9_FP3                1167
#define CANCON_RO9_ABAT               1168
#define CANCON_RO9_REQOP              1169
#define B1CON                         1170
#define B1CON_FILHIT0                 1171
#define B1CON_FILHIT0_TXPRI0          1172
#define B1CON_TXPRI0                  1173
#define B1FILHIT0                     1174
#define B1TXPRI0                      1175
#define B1CON_FILHIT1                 1176
#define B1CON_FILHIT1_TXPRI1          1177
#define B1CON_TXPRI1                  1178
#define B1FILHIT1                     1179
#define B1TXPRI1                      1180
#define B1CON_FILHIT2                 1181
#define B1RTREN                       1182
#define B1CON_RTREN                   1183
#define B1FILHIT2                     1184
#define B1CON_FILHIT2_RTREN           1185
#define B1CON_FILHIT3                 1186
#define B1TXREQ                       1187
#define B1CON_TXREQ                   1188
#define B1CON_FILHIT3_TXREQ           1189
#define B1FILHIT3                     1190
#define B1CON_FILHIT4                 1191
#define B1CON_FILHIT4_TXERR           1192
#define B1TXERR                       1193
#define B1FILHIT4                     1194
#define B1CON_TXERR                   1195
#define B1CON_RXRTRRO_TXLARB          1196
#define B1CON_TXLARB                  1197
#define B1TXLARB                      1198
#define B1CON_RXRTRRO                 1199
#define B1RTRRO                       1200
#define B1CON_TXABT                   1201
#define B1CON_RXM1                    1202
#define B1RXM1                        1203
#define B1CON_RXM1_TXABT              1204
#define B1TXABT                       1205
#define B1RXFUL                       1206
#define B1CON_RXFUL                   1207
#define B1TXB3IF                      1208
#define B1CON_TXBIF                   1209
#define B1CON_RXFUL_TXBIF             1210
#define B1SIDH                        1211
#define B1SIDH_SID                    1212
#define B1SIDH_SID3                   1213
#define B1SID3                        1214
#define B1SIDH_SID4                   1215
#define B1SID4                        1216
#define B1SIDH_SID5                   1217
#define B1SID5                        1218
#define B1SIDH_SID6                   1219
#define B1SID6                        1220
#define B1SIDH_SID7                   1221
#define B1SID7                        1222
#define B1SIDH_SID8                   1223
#define B1SID8                        1224
#define B1SIDH_SID9                   1225
#define B1SID9                        1226
#define B1SIDH_SID10                  1227
#define B1SID10                       1228
#define B1SIDL                        1229
#define B1SIDL_EID                    1230
#define B1EID16                       1231
#define B1SIDL_EID16                  1232
#define B1EID17                       1233
#define B1SIDL_EID17                  1234
#define B1SIDL_EXIDE                  1235
#define B1EXID                        1236
#define B1SRR                         1237
#define B1SIDL_SRR                    1238
#define B1SIDL_SID0                   1239
#define B1SIDL_SID                    1240
#define B1SID0                        1241
#define B1SIDL_SID1                   1242
#define B1SID1                        1243
#define B1SIDL_SID2                   1244
#define B1SID2                        1245
#define B1EIDH                        1246
#define B1EIDH_EID                    1247
#define B1EID8                        1248
#define B1EIDH_EID8                   1249
#define B1EID9                        1250
#define B1EIDH_EID9                   1251
#define B1EIDH_EID10                  1252
#define B1EID10                       1253
#define B1EIDH_EID11                  1254
#define B1EID11                       1255
#define B1EIDH_EID12                  1256
#define B1EID12                       1257
#define B1EIDH_EID13                  1258
#define B1EID13                       1259
#define B1EIDH_EID14                  1260
#define B1EID14                       1261
#define B1EIDH_EID15                  1262
#define B1EID15                       1263
#define B1EIDL                        1264
#define B1EIDL_EID                    1265
#define B1EID0                        1266
#define B1EIDL_EID0                   1267
#define B1EID1                        1268
#define B1EIDL_EID1                   1269
#define B1EID2                        1270
#define B1EIDL_EID2                   1271
#define B1EID3                        1272
#define B1EIDL_EID3                   1273
#define B1EID4                        1274
#define B1EIDL_EID4                   1275
#define B1EID5                        1276
#define B1EIDL_EID5                   1277
#define B1EID6                        1278
#define B1EIDL_EID6                   1279
#define B1EIDL_EID7                   1280
#define B1EID7                        1281
#define B1DLC                         1282
#define B1DLC0                        1283
#define B1DLC_DLC0                    1284
#define B1DLC_DLC                     1285
#define B1DLC1                        1286
#define B1DLC_DLC1                    1287
#define B1DLC2                        1288
#define B1DLC_DLC2                    1289
#define B1DLC3                        1290
#define B1DLC_DLC3                    1291
#define B1RB0                         1292
#define B1DLC_RB0                     1293
#define B1DLC_RB                      1294
#define B1RB1                         1295
#define B1DLC_RB1                     1296
#define B1DLC_RXRTR_TXRTR             1297
#define B1DLC_RXRTR                   1298
#define B1RXRTR                       1299
#define B1DLC_TXRTR                   1300
#define B1D00                         1301
#define B1D0                          1302
#define B1D01                         1303
#define B1D02                         1304
#define B1D03                         1305
#define B1D04                         1306
#define B1D05                         1307
#define B1D06                         1308
#define B1D07                         1309
#define B1D10                         1310
#define B1D1                          1311
#define B1D11                         1312
#define B1D12                         1313
#define B1D13                         1314
#define B1D14                         1315
#define B1D15                         1316
#define B1D16                         1317
#define B1D17                         1318
#define B1D20                         1319
#define B1D2                          1320
#define B1D21                         1321
#define B1D22                         1322
#define B1D23                         1323
#define B1D24                         1324
#define B1D25                         1325
#define B1D26                         1326
#define B1D27                         1327
#define B1D30                         1328
#define B1D3                          1329
#define B1D31                         1330
#define B1D32                         1331
#define B1D33                         1332
#define B1D34                         1333
#define B1D35                         1334
#define B1D36                         1335
#define B1D37                         1336
#define B1D40                         1337
#define B1D4                          1338
#define B1D41                         1339
#define B1D42                         1340
#define B1D43                         1341
#define B1D44                         1342
#define B1D45                         1343
#define B1D46                         1344
#define B1D47                         1345
#define B1D5                          1346
#define B1D50                         1347
#define B1D51                         1348
#define B1D52                         1349
#define B1D53                         1350
#define B1D54                         1351
#define B1D55                         1352
#define B1D56                         1353
#define B1D57                         1354
#define B1D60                         1355
#define B1D6                          1356
#define B1D61                         1357
#define B1D62                         1358
#define B1D63                         1359
#define B1D64                         1360
#define B1D65                         1361
#define B1D66                         1362
#define B1D67                         1363
#define B1D70                         1364
#define B1D7                          1365
#define B1D71                         1366
#define B1D72                         1367
#define B1D73                         1368
#define B1D74                         1369
#define B1D75                         1370
#define B1D76                         1371
#define B1D77                         1372
#define CANSTAT_RO8                   1373
#define CANSTAT_RO8_EICODE0           1374
#define CANSTAT_RO8_ICODE0            1375
#define CANSTAT_RO8_EICODE1_ICODE0    1376
#define CANSTAT_RO8_EICODE1           1377
#define CANSTAT_RO8_ICODE1            1378
#define CANSTAT_RO8_EICODE2_ICODE1    1379
#define CANSTAT_RO8_EICODE2           1380
#define CANSTAT_RO8_EICODE3_ICODE2    1381
#define CANSTAT_RO8_ICODE2            1382
#define CANSTAT_RO8_EICODE3           1383
#define CANSTAT_RO8_EICODE4           1384
#define CANSTAT_RO8_OPMODE0           1385
#define CANSTAT_RO8_OPMODE            1386
#define CANSTAT_RO8_OPMODE1           1387
#define CANSTAT_RO8_OPMODE2           1388
#define CANCON_RO8                    1389
#define CANCON_RO8_FP0                1390
#define CANCON_RO8_FP1                1391
#define CANCON_RO8_WIN0_FP1           1392
#define CANCON_RO8_WIN0               1393
#define CANCON_RO8_WIN1               1394
#define CANCON_RO8_FP2                1395
#define CANCON_RO8_WIN1_FP2           1396
#define CANCON_RO8_WIN2_FP3           1397
#define CANCON_RO8_FP3                1398
#define CANCON_RO8_WIN2               1399
#define CANCON_RO8_ABAT               1400
#define CANCON_RO8_REQOP              1401
#define B2CON                         1402
#define B2FILHIT0                     1403
#define B2TXPRI0                      1404
#define B2CON_FILHIT0_TXPRI0          1405
#define B2CON_FILHIT0                 1406
#define B2CON_TXPRI0                  1407
#define B2FILHIT1                     1408
#define B2TXPRI1                      1409
#define B2CON_FILHIT1_TXPRI1          1410
#define B2CON_FILHIT1                 1411
#define B2CON_TXPRI1                  1412
#define B2CON_RTREN                   1413
#define B2FILHIT2                     1414
#define B2RTREN                       1415
#define B2CON_FILHIT2                 1416
#define B2CON_FILHIT2_RTREN           1417
#define B2FILHIT3                     1418
#define B2CON_FILHIT3                 1419
#define B2TXREQ                       1420
#define B2CON_FILHIT3_TXREQ           1421
#define B2CON_TXREQ                   1422
#define B2FILHIT4                     1423
#define B2CON_TXERR                   1424
#define B2CON_FILHIT4_TXERR           1425
#define B2CON_FILHIT4                 1426
#define B2TXERR                       1427
#define B2RTRRO                       1428
#define B2TXLARB                      1429
#define B2CON_TXLARB                  1430
#define B2CON_RXRTRRO_TXLARB          1431
#define B2CON_RXRTRRO                 1432
#define B2TXABT                       1433
#define B2RXM1                        1434
#define B2CON_RXM1_TXABT              1435
#define B2CON_RXM1                    1436
#define B2CON_TXABT                   1437
#define B2TXB3IF                      1438
#define B2CON_TXBIF                   1439
#define B2CON_RXFUL                   1440
#define B2RXFUL                       1441
#define B2CON_RXFUL_TXBIF             1442
#define B2SIDH                        1443
#define B2SIDH_SID                    1444
#define B2SIDH_SID3                   1445
#define B2SID3                        1446
#define B2SIDH_SID4                   1447
#define B2SID4                        1448
#define B2SIDH_SID5                   1449
#define B2SID5                        1450
#define B2SIDH_SID6                   1451
#define B2SID6                        1452
#define B2SIDH_SID7                   1453
#define B2SID7                        1454
#define B2SIDH_SID8                   1455
#define B2SID8                        1456
#define B2SIDH_SID9                   1457
#define B2SID9                        1458
#define B2SID10                       1459
#define B2SIDH_SID10                  1460
#define B2SIDL                        1461
#define B2SIDL_EID                    1462
#define B2SIDL_EID16                  1463
#define B2EID16                       1464
#define B2SIDL_EID17                  1465
#define B2EID17                       1466
#define B2EXID                        1467
#define B2SIDL_EXIDE                  1468
#define B2EXIDE                       1469
#define B2SRR                         1470
#define B2SIDL_SRR                    1471
#define B2SIDL_SID0                   1472
#define B2SID0                        1473
#define B2SIDL_SID                    1474
#define B2SIDL_SID1                   1475
#define B2SID1                        1476
#define B2SIDL_SID2                   1477
#define B2SID2                        1478
#define B2EIDH                        1479
#define B2EIDH_EID                    1480
#define B2EID8                        1481
#define B2EIDH_EID8                   1482
#define B2EID9                        1483
#define B2EIDH_EID9                   1484
#define B2EID10                       1485
#define B2EIDH_EID10                  1486
#define B2EID11                       1487
#define B2EIDH_EID11                  1488
#define B2EID12                       1489
#define B2EIDH_EID12                  1490
#define B2EID13                       1491
#define B2EIDH_EID13                  1492
#define B2EID14                       1493
#define B2EIDH_EID14                  1494
#define B2EID15                       1495
#define B2EIDH_EID15                  1496
#define B2EIDL                        1497
#define B2EIDL_EID                    1498
#define B2EID0                        1499
#define B2EIDL_EID0                   1500
#define B2EID1                        1501
#define B2EIDL_EID1                   1502
#define B2EID2                        1503
#define B2EIDL_EID2                   1504
#define B2EID3                        1505
#define B2EIDL_EID3                   1506
#define B2EID4                        1507
#define B2EIDL_EID4                   1508
#define B2EID5                        1509
#define B2EIDL_EID5                   1510
#define B2EID6                        1511
#define B2EIDL_EID6                   1512
#define B2EID7                        1513
#define B2EIDL_EID7                   1514
#define B2DLC                         1515
#define B2DLC0                        1516
#define B2DLC_DLC                     1517
#define B2DLC_DLC0                    1518
#define B2DLC1                        1519
#define B2DLC_DLC1                    1520
#define B2DLC2                        1521
#define B2DLC_DLC2                    1522
#define B2DLC3                        1523
#define B2DLC_DLC3                    1524
#define B2RB0                         1525
#define B2DLC_RB                      1526
#define B2DLC_RB0                     1527
#define B2RB1                         1528
#define B2DLC_RB1                     1529
#define B2DLC_RXRTR_TXRTR             1530
#define B2DLC_RXRTR                   1531
#define B2RXRTR                       1532
#define B2DLC_TXRTR                   1533
#define B2D0                          1534
#define B2D00                         1535
#define B2D01                         1536
#define B2D02                         1537
#define B2D03                         1538
#define B2D04                         1539
#define B2D05                         1540
#define B2D06                         1541
#define B2D07                         1542
#define B2D1                          1543
#define B2D10                         1544
#define B2D11                         1545
#define B2D12                         1546
#define B2D13                         1547
#define B2D14                         1548
#define B2D15                         1549
#define B2D16                         1550
#define B2D17                         1551
#define B2D20                         1552
#define B2D2                          1553
#define B2D21                         1554
#define B2D22                         1555
#define B2D23                         1556
#define B2D24                         1557
#define B2D25                         1558
#define B2D26                         1559
#define B2D27                         1560
#define B2D30                         1561
#define B2D3                          1562
#define B2D31                         1563
#define B2D32                         1564
#define B2D33                         1565
#define B2D34                         1566
#define B2D35                         1567
#define B2D36                         1568
#define B2D37                         1569
#define B2D40                         1570
#define B2D4                          1571
#define B2D41                         1572
#define B2D42                         1573
#define B2D43                         1574
#define B2D44                         1575
#define B2D45                         1576
#define B2D46                         1577
#define B2D47                         1578
#define B2D50                         1579
#define B2D5                          1580
#define B2D51                         1581
#define B2D52                         1582
#define B2D53                         1583
#define B2D54                         1584
#define B2D55                         1585
#define B2D56                         1586
#define B2D57                         1587
#define B2D60                         1588
#define B2D6                          1589
#define B2D61                         1590
#define B2D62                         1591
#define B2D63                         1592
#define B2D64                         1593
#define B2D65                         1594
#define B2D66                         1595
#define B2D67                         1596
#define B2D70                         1597
#define B2D7                          1598
#define B2D71                         1599
#define B2D72                         1600
#define B2D73                         1601
#define B2D74                         1602
#define B2D75                         1603
#define B2D76                         1604
#define B2D77                         1605
#define CANSTAT_RO7                   1606
#define CANSTAT_RO7_EICODE0           1607
#define CANSTAT_RO7_EICODE1           1608
#define CANSTAT_RO7_ICODE0            1609
#define CANSTAT_RO7_EICODE1_ICODE0    1610
#define CANSTAT_RO7_EICODE2           1611
#define CANSTAT_RO7_EICODE2_ICODE1    1612
#define CANSTAT_RO7_ICODE1            1613
#define CANSTAT_RO7_EICODE3_ICODE2    1614
#define CANSTAT_RO7_EICODE3           1615
#define CANSTAT_RO7_ICODE2            1616
#define CANSTAT_RO7_EICODE4           1617
#define CANSTAT_RO7_OPMODE0           1618
#define CANSTAT_RO7_OPMODE            1619
#define CANSTAT_RO7_OPMODE1           1620
#define CANSTAT_RO7_OPMODE2           1621
#define CANCON_RO7                    1622
#define CANCON_RO7_FP0                1623
#define CANCON_RO7_FP1                1624
#define CANCON_RO7_WIN0               1625
#define CANCON_RO7_WIN0_FP1           1626
#define CANCON_RO7_WIN1_FP2           1627
#define CANCON_RO7_FP2                1628
#define CANCON_RO7_WIN1               1629
#define CANCON_RO7_FP3                1630
#define CANCON_RO7_WIN2_FP3           1631
#define CANCON_RO7_WIN2               1632
#define CANCON_RO7_ABAT               1633
#define CANCON_RO7_REQOP              1634
#define B3CON                         1635
#define B3CON_TXPRI0                  1636
#define B3CON_FILHIT0                 1637
#define B3TXPRI0                      1638
#define B3CON_FILHIT0_TXPRI0          1639
#define B3FILHIT0                     1640
#define B3CON_FILHIT1                 1641
#define B3CON_TXPRI1                  1642
#define B3TXPRI1                      1643
#define B3FILHIT1                     1644
#define B3CON_FILHIT1_TXPRI1          1645
#define B3CON_FILHIT2                 1646
#define B3CON_FILHIT2_RTREN           1647
#define B3RTREN                       1648
