tiborsimon/embedded-tdd-headers/pic/pic18/pic18f65k80_tdd.h
#define PCFG2                         3881
#define ANSEL3                        3882
#define PCFG3                         3883
#define ANSEL4                        3884
#define PCFG4                         3885
#define ANSEL5                        3886
#define PCFG5                         3887
#define ANSEL6                        3888
#define PCFG6                         3889
#define ANSEL7                        3890
#define PCFG7                         3891
#define CM2CON                        3892
#define CM2CON_CCH                    3893
#define CM2CON_CCH0                   3894
#define CCH02                         3895
#define CCH12                         3896
#define CM2CON_CCH1                   3897
#define CM2CON_CREF                   3898
#define CREF2                         3899
#define CM2CON_EVPOL                  3900
#define EVPOL02                       3901
#define CM2CON_EVPOL0                 3902
#define EVPOL12                       3903
#define CM2CON_EVPOL1                 3904
#define CM2CON_CPOL                   3905
#define CPOL2                         3906
#define CM2CON_COE                    3907
#define COE2                          3908
#define CM2CON_CON                    3909
#define CON2                          3910
#define CM1CON                        3911
#define CM1CON_CCH                    3912
#define C1CH0                         3913
#define CM1CON_CCH0                   3914
#define CCH01                         3915
#define CCH11                         3916
#define C1CH1                         3917
#define CM1CON_CCH1                   3918
#define CM1CON_CREF                   3919
#define CREF1                         3920
#define EVPOL01                       3921
#define CM1CON_EVPOL0                 3922
#define CM1CON_EVPOL                  3923
#define CM1CON_EVPOL1                 3924
#define EVPOL11                       3925
#define CM1CON_CPOL                   3926
#define CPOL1                         3927
#define CM1CON_COE                    3928
#define COE1                          3929
#define CM1CON_CON                    3930
#define CON1                          3931
#define RXB0CON                       3932
#define RXB0CON_FILHIT0               3933
#define RXB0FILHIT0                   3934
#define JTOFF_FILHIT1                 3935
#define RXB0CON_FILHIT1               3936
#define RXB0FILHIT1                   3937
#define JTOFF                         3938
#define RB0DBEN_FILHIT2               3939
#define RB0DBEN                       3940
#define RXB0FILHIT2                   3941
#define RXB0CON_FILHIT2               3942
#define RXB0CON_RXRTRRO               3943
#define RXB0FILHIT3                   3944
#define RXB0CON_RXRTRRO_FILHIT3       3945
#define RXB0CON_FILHIT3               3946
#define RXB0RTRR0                     3947
#define RXB0CON_FILHIT4               3948
#define RXB0FILHIT4                   3949
#define RXB0RTRRO                     3950
#define RXB0CON_RXM0_RTRRO            3951
#define RXB0M0                        3952
#define RXB0CON_RTRRO                 3953
#define RXB0CON_RXM0                  3954
#define RXB0M1                        3955
#define RXB0CON_RXM1                  3956
#define RXB0FUL                       3957
#define RXB0CON_RXFUL                 3958
#define RXB0SIDH                      3959
#define RXB0SIDH_SID                  3960
#define RXB0SIDH_SID3                 3961
#define RXB0SID3                      3962
#define RXB0SIDH_SID4                 3963
#define RXB0SID4                      3964
#define RXB0SIDH_SID5                 3965
#define RXB0SID5                      3966
#define RXB0SIDH_SID6                 3967
#define RXB0SID6                      3968
#define RXB0SIDH_SID7                 3969
#define RXB0SID7                      3970
#define RXB0SIDH_SID8                 3971
#define RXB0SID8                      3972
#define RXB0SIDH_SID9                 3973
#define RXB0SID9                      3974
#define RXB0SIDH_SID10                3975
#define RXB0SID10                     3976
#define RXB0SIDL                      3977
#define RXB0SIDL_EID                  3978
#define RXB0SIDL_EID16                3979
#define RXB0EID16                     3980
#define RXB0SIDL_EID17                3981
#define RXB0EID17                     3982
#define RXB0EXID                      3983
#define RXB0SIDL_EXID                 3984
#define RXB0SIDL_SRR                  3985
#define RXB0SRR                       3986
#define RXB0SID0                      3987
#define RXB0SIDL_SID0                 3988
#define RXB0SIDL_SID                  3989
#define RXB0SIDL_SID1                 3990
#define RXB0SID1                      3991
#define RXB0SIDL_SID2                 3992
#define RXB0SID2                      3993
#define RXB0EIDH                      3994
#define RXB0EID8                      3995
#define RXB0EIDH_EID                  3996
#define RXB0EIDH_EID8                 3997
#define RXB0EID9                      3998
#define RXB0EIDH_EID9                 3999
#define RXB0EID10                     4000
#define RXB0EIDH_EID10                4001
#define RXB0EID11                     4002
#define RXB0EIDH_EID11                4003
#define RXB0EID12                     4004
#define RXB0EIDH_EID12                4005
#define RXB0EID13                     4006
#define RXB0EIDH_EID13                4007
#define RXB0EID14                     4008
#define RXB0EIDH_EID14                4009
#define RXB0EID15                     4010
#define RXB0EIDH_EID15                4011
#define RXB0EIDL                      4012
#define RXB0EID0                      4013
#define RXB0EIDL_EID                  4014
#define RXB0EIDL_EID0                 4015
#define RXB0EID1                      4016
#define RXB0EIDL_EID1                 4017
#define RXB0EID2                      4018
#define RXB0EIDL_EID2                 4019
#define RXB0EID3                      4020
#define RXB0EIDL_EID3                 4021
#define RXB0EID4                      4022
#define RXB0EIDL_EID4                 4023
#define RXB0EID5                      4024
#define RXB0EIDL_EID5                 4025
#define RXB0EID6                      4026
#define RXB0EIDL_EID6                 4027
#define RXB0EID7                      4028
#define RXB0EIDL_EID7                 4029
#define RXB0DLC                       4030
#define RXB0DLC_DLC0                  4031
#define RXB0DLC_DLC                   4032
#define RXB0DLC0                      4033
#define RXB0DLC1                      4034
#define RXB0DLC_DLC1                  4035
#define RXB0DLC2                      4036
#define RXB0DLC_DLC2                  4037
#define RXB0DLC3                      4038
#define RXB0DLC_DLC3                  4039
#define RXB0DLC_RB                    4040
#define RXB0RB0                       4041
#define RXB0DLC_RB0                   4042
#define RXB0RB1                       4043
#define RXB0DLC_RB1                   4044
#define RXB0DLC_RXRTR                 4045
#define RXB0RTR                       4046
#define RXB0D0                        4047
#define RXB0D00                       4048
#define RXB0D01                       4049
#define RXB0D02                       4050
#define RXB0D03                       4051
#define RXB0D04                       4052
#define RXB0D05                       4053
#define RXB0D06                       4054
#define RXB0D07                       4055
#define RXB0D1                        4056
#define RXB0D10                       4057
#define RXB0D11                       4058
#define RXB0D12                       4059
#define RXB0D13                       4060
#define RXB0D14                       4061
#define RXB0D15                       4062
#define RXB0D16                       4063
#define RXB0D17                       4064
#define RXB0D2                        4065
#define RXB0D20                       4066
#define RXB0D21                       4067
#define RXB0D22                       4068
#define RXB0D23                       4069
#define RXB0D24                       4070
#define RXB0D25                       4071
#define RXB0D26                       4072
#define RXB0D27                       4073
#define RXB0D3                        4074
#define RXB0D30                       4075
#define RXB0D31                       4076
#define RXB0D32                       4077
#define RXB0D33                       4078
#define RXB0D34                       4079
#define RXB0D35                       4080
#define RXB0D36                       4081
#define RXB0D37                       4082
#define RXB0D4                        4083
#define RXB0D40                       4084
#define RXB0D41                       4085
#define RXB0D42                       4086
#define RXB0D43                       4087
#define RXB0D44                       4088
#define RXB0D45                       4089
#define RXB0D46                       4090
#define RXB0D47                       4091
#define RXB0D5                        4092
#define RXB0D50                       4093
#define RXB0D51                       4094
#define RXB0D52                       4095
#define RXB0D53                       4096
#define RXB0D54                       4097
#define RXB0D55                       4098
#define RXB0D56                       4099
#define RXB0D57                       4100
#define RXB0D6                        4101
#define RXB0D60                       4102
#define RXB0D61                       4103
#define RXB0D62                       4104
#define RXB0D63                       4105
#define RXB0D64                       4106
#define RXB0D65                       4107
#define RXB0D66                       4108
#define RXB0D67                       4109
#define RXB0D7                        4110
#define RXB0D70                       4111
#define RXB0D71                       4112
#define RXB0D72                       4113
#define RXB0D73                       4114
#define RXB0D74                       4115
#define RXB0D75                       4116
#define RXB0D76                       4117
#define RXB0D77                       4118
#define CANSTAT                       4119
#define CANSTAT_EICODE0               4120
#define CANSTAT_EICODE1               4121
#define CANSTAT_ICODE0                4122
#define CANSTAT_EICODE1_ICODE0        4123
#define CANSTAT_EICODE2               4124
#define CANSTAT_ICODE1                4125
#define CANSTAT_EICODE2_ICODE1        4126
#define CANSTAT_EICODE3               4127
#define CANSTAT_ICODE2                4128
#define CANSTAT_EICODE3_ICODE2        4129
#define CANSTAT_EICODE4               4130
#define CANSTAT_OPMODE0               4131
#define CANSTAT_OPMODE                4132
#define CANSTAT_OPMODE1               4133
#define CANSTAT_OPMODE2               4134
#define CANCON                        4135
#define CANCON_FP0                    4136
#define CANCON_FP1                    4137
#define CANCON_WIN0                   4138
#define CANCON_WIN0_FP1               4139
#define CANCON_FP2                    4140
#define CANCON_WIN1                   4141
#define CANCON_WIN1_FP2               4142
#define CANCON_FP3                    4143
#define CANCON_WIN2                   4144
#define CANCON_WIN2_FP3               4145
#define CANCON_ABAT                   4146
#define CANCON_REQOP                  4147
#define CIOCON                        4148
#define CLKSEL                        4149
#define CANCAP                        4150
#define ENDRHI                        4151
#define TX2EN                         4152
#define TX2SRC                        4153
#define COMSTAT                       4154
#define EWARN                         4155
#define RXWARN                        4156
#define TXWARN                        4157
#define RXBP                          4158
#define TXBP                          4159
#define TXBO                          4160
#define RXB1OVFL                      4161
#define RXBNOVFL                      4162
#define FIFOEMPTY                     4163
#define RXB0OVFL                      4164
#define NOT_FIFOEMPTY                 4165
#define nFIFOEMPTY                    4166
#define ECANCON                       4167
#define EWIN                          4168
#define EWIN0                         4169
#define EWIN1                         4170
#define EWIN2                         4171
#define EWIN3                         4172
#define EWIN4                         4173
#define FIFOWM                        4174
#define MDSEL0                        4175
#define MDSEL                         4176
#define MDSEL1                        4177
#define EEDATA                        4178
#define EEADR                         4179
#define EEADRH                        4180
#define PIE5                          4181
#define FIFOWMIE                      4182
#define PIE5_RXB0IE                   4183
#define RXBnIE                        4184
#define PIE5_RXB1IE                   4185
#define PIE5_TXB0IE                   4186
#define PIE5_TXB1IE                   4187
#define PIE5_TXB2IE                   4188
#define TXBnIE                        4189
#define ERRIE                         4190
#define WAKIE                         4191
#define IRXIE                         4192
#define PIR5                          4193
#define FIFOWMIF                      4194
#define RXB0IF                        4195
#define RXBnIF                        4196
#define RXB1IF                        4197
#define TXB0IF                        4198
#define TXB1IF                        4199
#define TXB2IF                        4200
#define TXBnIF                        4201
#define ERRIF                         4202
#define WAKIF                         4203
#define IRXIF                         4204
#define IPR5                          4205
#define RXB0IP                        4206
#define CCH05                         4207
#define FIFOWMIP                      4208
#define RXB1IP                        4209
#define CCH15                         4210
#define RXBnIP                        4211
#define TXB0IP                        4212
#define EVPOL05                       4213
#define TXB1IP                        4214
#define EVPOL15                       4215
#define TXBnIP                        4216
#define TXB2IP                        4217
#define ERRIP                         4218
#define WAKIP                         4219
#define IRXIP                         4220
#define TXREG2                        4221
#define RCREG2                        4222
#define SPBRG2                        4223
#define SPBRGH2                       4224
#define SPBRGH1                       4225
#define EECON2                        4226
#define EECON1                        4227
#define RD                            4228
#define WR                            4229
#define WREN                          4230
#define WRERR                         4231
#define FREE                          4232
#define CFGS                          4233
#define EEFS                          4234
#define EEPGD                         4235
#define PORTA                         4236
#define ULPWUIN                       4237
#define RA0                           4238
#define RA1                           4239
#define RA2                           4240
#define RA3                           4241
#define LVDIN                         4242
#define RA5                           4243
#define RA6                           4244
#define RA7                           4245
#define RJPU                          4246
#define PORTB                         4247
#define PORTB_RB0                     4248
#define PORTB_RB1                     4249
#define RB2                           4250
#define CCP2_PA2                      4251
#define RB3                           4252
#define RB4                           4253
#define RB5                           4254
#define RB6                           4255
#define RB7                           4256
#define PORTC                         4257
#define RC0                           4258
#define PA2                           4259
#define RC1                           4260
#define CCP2                          4261
#define PA1                           4262
#define RC2                           4263
#define RC3                           4264
#define RC4                           4265
#define RC5                           4266
#define RC6                           4267
#define RC7                           4268
#define PORTD                         4269
#define RD0                           4270
#define RD1                           4271
#define RD2                           4272
#define RD3                           4273
#define RD4                           4274
#define RD5                           4275
#define RD6                           4276
#define RD7                           4277
#define SS2                           4278
#define PORTE                         4279
#define PD2                           4280
#define RDE                           4281
#define RE0                           4282
#define WRE                           4283
#define RE1                           4284
#define PC2                           4285
#define CCP10                         4286
#define PB2                           4287
#define CS                            4288
#define RE2                           4289
#define CCP9E                         4290
#define RE3                           4291
#define PC3E                          4292
#define PB3E                          4293
#define RE4                           4294
#define CCP8E                         4295
#define CCP7E                         4296
#define RE5                           4297
#define PC1E                          4298
#define CCP6E                         4299
#define RE6                           4300
#define PB1E                          4301
#define CCP2E                         4302
#define PA2E                          4303
#define RE7                           4304
#define PORTF                         4305
#define RF0                           4306
#define RF1                           4307
#define C2OUTF                        4308
#define RF2                           4309
#define C1OUTF                        4310
#define RF3                           4311
#define RF4                           4312
#define RF5                           4313
#define RF6                           4314
#define RF7                           4315
#define PORTG                         4316
#define RG0                           4317
#define RG1                           4318
#define C3OUTG                        4319
#define RG2                           4320
#define RG3                           4321
#define RG4                           4322
#define TMR4                          4323
#define T4CON                         4324
#define T4CKPS0                       4325
#define T4CKPS                        4326
#define T4CKPS1                       4327
#define TMR4ON                        4328
#define T4OUTPS                       4329
#define T4OUTPS0                      4330
#define T4OUTPS1                      4331
#define T4OUTPS2                      4332
#define T4OUTPS3                      4333
#define LATA                          4334
#define LATA0                         4335
#define LA0                           4336
#define LATA1                         4337
#define LA1                           4338
#define LATA2                         4339
#define LA2                           4340
#define LATA3                         4341
#define LA3                           4342
#define LATA5                         4343
#define LA5                           4344
#define LATA6                         4345
#define LA6                           4346
#define LATA7                         4347
#define LA7                           4348
#define LATB                          4349
#define LB0                           4350
#define LATB0                         4351
#define LB1                           4352
#define LATB1                         4353
#define LB2                           4354
#define LATB2                         4355
#define LB3                           4356
#define LATB3                         4357
#define LB4                           4358
#define LATB4                         4359
#define LB5                           4360
#define LATB5                         4361
#define LB6                           4362
#define LATB6                         4363
#define LB7                           4364
#define LATB7                         4365
#define LATC                          4366
#define LATC0                         4367
#define LC0                           4368
#define LATC1                         4369
#define LC1                           4370
#define LATC2                         4371
#define LC2                           4372
#define LATC3                         4373
#define LC3                           4374
#define LATC4                         4375
#define LC4                           4376
#define LATC5                         4377
#define LC5                           4378
#define LATC6                         4379
#define LC6                           4380
#define LATC7                         4381
#define LC7                           4382
#define LATD                          4383
#define LATD0                         4384
#define LD0                           4385
#define LATD1                         4386
#define LD1                           4387
#define LATD2                         4388
#define LD2                           4389
#define LATD3                         4390
#define LD3                           4391
#define LATD4                         4392
#define LD4                           4393
#define LATD5                         4394
#define LD5                           4395
#define LATD6                         4396
#define LD6                           4397
#define LATD7                         4398
#define LD7                           4399
#define LATE                          4400
#define LATE0                         4401
#define LE0                           4402
#define LATE1                         4403
#define LE1                           4404
#define LATE2                         4405
#define LE2                           4406
#define LATE4                         4407
#define LE4                           4408
#define LATE5                         4409
#define LE5                           4410
#define LATE6                         4411
#define LE6                           4412
#define LATE7                         4413
#define LE7                           4414
#define LATF                          4415
#define LATF0                         4416
#define LF0                           4417
#define LATF1                         4418
#define LF1                           4419
#define LF2                           4420
#define LATF2                         4421
#define LF3                           4422
#define LATF3                         4423
#define LF4                           4424
#define LATF4                         4425
#define LF5                           4426
#define LATF5                         4427
#define LF6                           4428
#define LATF6                         4429
#define LF7                           4430
#define LATF7                         4431
#define LATG                          4432
#define LATG0                         4433
#define LG0                           4434
#define LATG1                         4435
#define LG1                           4436
#define LATG2                         4437
#define LG2                           4438
